mt-sms-service-ws-example-text.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mt="http://ws.orange.pl/mt-sms-service-ws" xmlns:mes="http://ws.orange.pl/mt-sms-service-ws/message">
    <soapenv:Header>
        <mt:Security>
            <mt:username>LOGIN</mt:username>
            <mt:password>PASS</mt:password>
        </mt:Security>
    </soapenv:Header>
    <soapenv:Body>
        <mt:SubmitShortMessage>
            <mt:sms>
                <mes:content>TEST - wiadomość z polskimi znakami</mes:content>
                <mes:expiryDate>2014-01-01T12:00:00</mes:expiryDate>
                <mes:recipient>507998000</mes:recipient>
                <mes:originator>12345</mes:originator>
            </mt:sms>
        </mt:SubmitShortMessage>
    </soapenv:Body>
</soapenv:Envelope>
